ghent360/Marlin/Marlin/src/HAL/HAL_STM32_F4_F7/fastio.h
#ifdef GPIOF_BASE
    // PORTF
    {
#ifdef PF0
        PF0,
#else
        (uint16_t)-1,
#endif
#ifdef PF1
        PF1,
#else
        (uint16_t)-1,
#endif
#ifdef PF2
        PF2,
#else
        (uint16_t)-1,
#endif
#ifdef PF3
        PF3,
#else
        (uint16_t)-1,
#endif
#ifdef PF4
        PF4,
#else
        (uint16_t)-1,
#endif
#ifdef PF5
        PF5,
#else
        (uint16_t)-1,
#endif
#ifdef PF6
        PF6,
#else
        (uint16_t)-1,
#endif
#ifdef PF7
        PF7,
#else
        (uint16_t)-1,
#endif
#ifdef PF8
        PF8,
#else
        (uint16_t)-1,
#endif
#ifdef PF9
        PF9,
#else
        (uint16_t)-1,
#endif
#ifdef PF10
        PF10,
#else
        (uint16_t)-1,
#endif
#ifdef PF11
        PF11,
#else
        (uint16_t)-1,
#endif
#ifdef PF12
        PF12,
#else
        (uint16_t)-1,
#endif
#ifdef PF13
        PF13,
#else
        (uint16_t)-1,
#endif
#ifdef PF14
        PF14,
#else
        (uint16_t)-1,
#endif
#ifdef PF15
        PF15,
#else
        (uint16_t)-1,
#endif
    },
#endif // GPIOF_BASE

#ifdef GPIOG_BASE
    // PORTG
    {
#ifdef PG0
        PG0,
#else
        (uint16_t)-1,
#endif
#ifdef PG1
        PG1,
#else
        (uint16_t)-1,
#endif
#ifdef PG2
        PG2,
#else
        (uint16_t)-1,
#endif
#ifdef PG3
        PG3,
#else
        (uint16_t)-1,
#endif
#ifdef PG4
        PG4,
#else
        (uint16_t)-1,
#endif
#ifdef PG5
        PG5,
#else
        (uint16_t)-1,
#endif
#ifdef PG6
        PG6,
#else
        (uint16_t)-1,
#endif
#ifdef PG7
        PG7,
#else
        (uint16_t)-1,
#endif
#ifdef PG8
        PG8,
#else
        (uint16_t)-1,
#endif
#ifdef PG9
        PG9,
#else
        (uint16_t)-1,
#endif
#ifdef PG10
        PG10,
#else
        (uint16_t)-1,
#endif
#ifdef PG11
        PG11,
#else
        (uint16_t)-1,
#endif
#ifdef PG12
        PG12,
#else
        (uint16_t)-1,
#endif
#ifdef PG13
        PG13,
#else
        (uint16_t)-1,
#endif
#ifdef PG14
        PG14,
#else
        (uint16_t)-1,
#endif
#ifdef PG15
        PG15,
#else
        (uint16_t)-1,
#endif
    },
#endif // GPIOG_BASE

#ifdef GPIOH_BASE
    // PORTH
    {
#ifdef PH0
        PH0,
#else
        (uint16_t)-1,
#endif
#ifdef PH1
        PH1,
#else
        (uint16_t)-1,
#endif
#ifdef PH2
        PH2,
#else
        (uint16_t)-1,
#endif
#ifdef PH3
        PH3,
#else
        (uint16_t)-1,
#endif
#ifdef PH4
        PH4,
#else
        (uint16_t)-1,
#endif
#ifdef PH5
        PH5,
#else
        (uint16_t)-1,
#endif
#ifdef PH6
        PH6,
#else
        (uint16_t)-1,
#endif
#ifdef PH7
        PH7,
#else
        (uint16_t)-1,
#endif
#ifdef PH8
        PH8,
#else
        (uint16_t)-1,
#endif
#ifdef PH9
        PH9,
#else
        (uint16_t)-1,
#endif
#ifdef PH10
        PH10,
#else
        (uint16_t)-1,
#endif
#ifdef PH11
        PH11,
#else
        (uint16_t)-1,
#endif
#ifdef PH12
        PH12,
#else
        (uint16_t)-1,
#endif
#ifdef PH13
        PH13,
#else
        (uint16_t)-1,
#endif
#ifdef PH14
        PH14,
#else
        (uint16_t)-1,
#endif
#ifdef PH15
        PH15,
#else
        (uint16_t)-1,
#endif
    },
#endif // GPIOH_BASE

#ifdef GPIOI_BASE
    // PORTI
    {
#ifdef PI0
        PI0,
#else
        (uint16_t)-1,
#endif
#ifdef PI1
        PI1,
#else
        (uint16_t)-1,
#endif
#ifdef PI2
        PI2,
#else
        (uint16_t)-1,
#endif
#ifdef PI3
        PI3,
#else
        (uint16_t)-1,
#endif
#ifdef PI4
        PI4,
#else
        (uint16_t)-1,
#endif
#ifdef PI5
        PI5,
#else
        (uint16_t)-1,
#endif
#ifdef PI6
        PI6,
#else
        (uint16_t)-1,
#endif
#ifdef PI7
        PI7,
#else
        (uint16_t)-1,
#endif
#ifdef PI8
        PI8,
#else
        (uint16_t)-1,
#endif
#ifdef PI9
        PI9,
#else
        (uint16_t)-1,
#endif
#ifdef PI10
        PI10,
#else
        (uint16_t)-1,
#endif
#ifdef PI11
        PI11,
#else
        (uint16_t)-1,
#endif
#ifdef PI12
        PI12,
#else
        (uint16_t)-1,
#endif
#ifdef PI13
        PI13,
#else
        (uint16_t)-1,
#endif
#ifdef PI14
        PI14,
#else
        (uint16_t)-1,
#endif
#ifdef PI15
        PI15,
#else
        (uint16_t)-1,
#endif
    },
#endif // GPIOI_BASE

#ifdef GPIOJ_BASE
    // PORTJ
    {
#ifdef PJ0
        PJ0,
#else
        (uint16_t)-1,
#endif
#ifdef PJ1
        PJ1,
#else
        (uint16_t)-1,
#endif
#ifdef PJ2
        PJ2,
#else
        (uint16_t)-1,
#endif
#ifdef PJ3
        PJ3,
#else
        (uint16_t)-1,
#endif
#ifdef PJ4
        PJ4,
#else
        (uint16_t)-1,
#endif
#ifdef PJ5
        PJ5,
#else
        (uint16_t)-1,
#endif
#ifdef PJ6
        PJ6,
#else
        (uint16_t)-1,
#endif
#ifdef PJ7
        PJ7,
#else
        (uint16_t)-1,
#endif
#ifdef PJ8
        PJ8,
#else
        (uint16_t)-1,
#endif
#ifdef PJ9
        PJ9,
#else
        (uint16_t)-1,
#endif
#ifdef PJ10
        PJ10,
#else
        (uint16_t)-1,
#endif
#ifdef PJ11
        PJ11,
#else
        (uint16_t)-1,
#endif
#ifdef PJ12
        PJ12,
#else
        (uint16_t)-1,
#endif
#ifdef PJ13
        PJ13,
#else
        (uint16_t)-1,
#endif
#ifdef PJ14
        PJ14,
#else
        (uint16_t)-1,
#endif
#ifdef PJ15
        PJ15,
#else
        (uint16_t)-1,
#endif
    },
#endif // GPIOJ_BASE

#ifdef GPIOK_BASE
    // PORTK
    {
#ifdef PK0
        PK0,
#else
        (uint16_t)-1,
#endif
#ifdef PK1
        PK1,
#else
        (uint16_t)-1,
#endif
#ifdef PK2
        PK2,
#else
        (uint16_t)-1,
#endif
#ifdef PK3
        PK3,
#else
        (uint16_t)-1,
#endif
#ifdef PK4
        PK4,
#else
        (uint16_t)-1,
#endif
#ifdef PK5
        PK5,
#else
        (uint16_t)-1,
#endif
#ifdef PK6
        PK6,
#else
        (uint16_t)-1,
#endif
#ifdef PK7
        PK7,
#else
        (uint16_t)-1,
#endif
#ifdef PK8
        PK8,
#else
        (uint16_t)-1,
#endif
#ifdef PK9
        PK9,
#else
        (uint16_t)-1,
#endif
#ifdef PK10
        PK10,
#else
        (uint16_t)-1,
#endif
#ifdef PK11
        PK11,
#else
        (uint16_t)-1,
#endif
#ifdef PK12
        PK12,
#else
        (uint16_t)-1,
#endif
#ifdef PK13
        PK13,
#else
        (uint16_t)-1,
#endif
#ifdef PK14
        PK14,
#else
        (uint16_t)-1,
#endif
#ifdef PK15
        PK15,
#else
        (uint16_t)-1,
#endif
    },
#endif // GPIOK_BASE

