ghent360/Marlin/Marlin/src/HAL/HAL_STM32_F4_F7/fastio.h
#ifdef GPIOZ_BASE
    // PORTZ
    {
#ifdef PZ0
        PZ0,
#else
        (uint16_t)-1,
#endif
#ifdef PZ1
        PZ1,
#else
        (uint16_t)-1,
#endif
#ifdef PZ2
        PZ2,
#else
        (uint16_t)-1,
#endif
#ifdef PZ3
        PZ3,
#else
        (uint16_t)-1,
#endif
#ifdef PZ4
        PZ4,
#else
        (uint16_t)-1,
#endif
#ifdef PZ5
        PZ5,
#else
        (uint16_t)-1,
#endif
#ifdef PZ6
        PZ6,
#else
        (uint16_t)-1,
#endif
#ifdef PZ7
        PZ7,
#else
        (uint16_t)-1,
#endif
#ifdef PZ8
        PZ8,
#else
        (uint16_t)-1,
#endif
#ifdef PZ9
        PZ9,
#else
        (uint16_t)-1,
#endif
#ifdef PZ10
        PZ10,
#else
        (uint16_t)-1,
#endif
#ifdef PZ11
        PZ11,
#else
        (uint16_t)-1,
#endif
#ifdef PZ12
        PZ12,
#else
        (uint16_t)-1,
#endif
#ifdef PZ13
        PZ13,
#else
        (uint16_t)-1,
#endif
#ifdef PZ14
        PZ14,
#else
        (uint16_t)-1,
#endif
#ifdef PZ15
        PZ15,
#else
        (uint16_t)-1,
#endif
    },
#endif // GPIOZ_BASE

    };
};

template <uint16_t IO>
constexpr inline FastIOPin makeFastIO() {
  static_assert(IS_FAST_IO_PIN(IO), "Requires FAST_PIN.");
  return FastIOPin(GET_PORT(IO), GET_PIN_IDX(IO));
}

constexpr inline uint16_t makeSlowIO(uint16_t IO) {
  if (IS_FAST_IO_PIN(IO)) {
    return FastIOPin(GET_PORT(IO), GET_PIN_IDX(IO)).toArduinoPin();
  }
  return IO;
}
#endif // USE_FAST_IO

#define FAST_PIN(port_letter, pin_no) FAST_IO_PIN(Port##port_letter, pin_no)
#define SLOW_PIN(port_letter, pin_no) P##port_letter##pin_no

#ifdef USE_FAST_IO
#define IO_PIN(prt, no) FAST_PIN(prt, no)
#define ARDUINO_PIN(IO) makeSlowIO(IO)
#else
#define IO_PIN(prt, no) SLOW_PIN(prt, no)
#define ARDUINO_PIN(IO) (IO)
#endif


#ifdef USE_FAST_IO
#define READ(IO)                makeFastIO<IO>().read()
#define WRITE(IO,V)             makeFastIO<IO>().write(V)
#else
#define READ(IO)                digitalRead(IO)
#define WRITE(IO,V)             digitalWrite(IO,V)
#endif

//#define _GET_MODE(IO)

#ifdef USE_FAST_IO
#define _SET_MODE(IO, M)        makeFastIO<IO>().set_mode(M)
#else
#define _SET_MODE(IO,M)         pinMode(IO, M)
#endif
#define _SET_OUTPUT(IO)         _SET_MODE(IO, OUTPUT)

#define OUT_WRITE(IO,V)         WRITE(IO,V)

#define SET_INPUT(IO)           _SET_MODE(IO, INPUT)                              /*!< Input Floating Mode                   */
#define SET_INPUT_PULLUP(IO)    _SET_MODE(IO, INPUT_PULLUP)                       /*!< Input with Pull-up activation         */
#define SET_INPUT_PULLDOWN(IO)  _SET_MODE(IO, INPUT_PULLDOWN)                     /*!< Input with Pull-down activation       */
#define SET_OUTPUT(IO)          _SET_MODE(IO, OUTPUT)

#define SET_PWM(IO)             pinMode(ARDUINO_PIN(IO), OUTPUT)

#ifdef USE_FAST_IO
#define TOGGLE(IO)              makeFastIO<IO>().toggle()
#else
#define TOGGLE(IO)              OUT_WRITE(IO, !READ(IO))
#endif

#define IS_INPUT(IO)
#define IS_OUTPUT(IO)

#define PWM_PIN(P)              true

// digitalRead/Write wrappers
#define extDigitalRead(IO)    digitalRead(ARDUINO_PIN(IO))
#define extDigitalWrite(IO,V) digitalWrite(ARDUINO_PIN(IO), V)

